{
  "id": "85d1581c-62d4-4d2d-953a-85ebfce944ae",
  "title": "Sugar and Light",
  "author": {
    "name": "D.M. Storm",
    "biography": "Writes from her houseboat in Amsterdam, enjoying the view of the canals from her desk."
  },
  "wordCount": 39777,
  "publicationDate": "2025-12-02T12:46:30.509870",
  "forceRank": null,
  "summary": {
    "under120": "When Miami art conservator Valentina Reyes arrives at the opulent Villa Sombra to restore a centuries-old Spanish masterpiece, she discovers more than cracked varnish and faded pigments—she uncovers a dangerous attraction to Diego Castillo, the brooding heir whose family's dark secrets could destroy them both. As Valentina's meticulous examination reveals the painting is an elaborate forgery, she faces an impossible choice between preserving the truth and protecting the man who has awakened desires she's spent years suppressing. In this sultry tale of artistic passion and moral courage, two damaged souls must decide whether love is worth burning down everything they've built to protect.",
    "under240": "When conservator Valentina Reyes arrives at the opulent Villa Sombra to restore a prized family painting, she expects to work in sterile silence—until she collides with Diego Castillo, the brooding heir whose dangerous magnetism threatens to shatter her carefully controlled world. As Diego's raw sensuality and artistic passion ignite a fire she's spent years suppressing, Valentina discovers something devastating: the painting she's restoring is an elaborate fake, commissioned by Diego's grandfather to save the family fortune. Torn between her professional integrity and her consuming desire for the man who could lose everything, Valentina faces an impossible choice that will either destroy them both or strip away every beautiful lie to reveal the scorching truth beneath. In this intoxicating tale of forbidden desire and moral reckoning, two damaged souls must decide whether love built on deception can survive the harsh light of authenticity—or if some masterpieces are worth burning down empires to protect.",
    "logLine": "When a brilliant art conservator discovers the Castillo family's prized masterpiece is a modern forgery, she must choose between exposing the truth that will destroy the dangerously seductive heir she's fallen for—or becoming complicit in the lie that could save them both."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": "https://mybook.to/Of2mrjj",
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}