{
  "id": "01089592-8f65-489f-b338-4487ccc39ae5",
  "title": "Malbec Moon",
  "author": {
    "name": "A.B. Frost",
    "biography": "Lives in Portland with her two rescue dogs and a plant collection that has taken over most of her living room."
  },
  "wordCount": 39960,
  "publicationDate": "2025-12-03T23:33:48.192718",
  "forceRank": null,
  "summary": {
    "under120": "When wine critic Luciana Santos arrives at a remote Argentinian vineyard to review a reclusive winemaker's vintage, she expects to deliver her signature surgical takedown—until a devastating hailstorm forces her to abandon her silk armor and fight alongside Matías Huencho to save his harvest. As Luciana trades her sterile glass tower for calloused hands and purple-stained fingers, she discovers that the most dangerous vintage isn't in the cellar—it's the intoxicating blend of raw earth, untamed desire, and a man who refuses to be scored on any scale but his own.",
    "under240": "When sommelier Luciana Santos arrives at a remote Argentine vineyard to review the wines of reclusive winemaker Matías Huencho, she expects to write another clinical takedown of rustic pretension. Instead, she finds herself stripped of her sterile certainties when a violent hailstorm forces them together in a desperate race to save the vintage. As Luciana abandons her silk armor for mud-stained denim and trades her analytical distance for the raw intimacy of harvest work, she discovers that Matías doesn't just make wine—he creates liquid rebellion against everything her polished world represents. But when her editor demands she expose the \"Hermit of the Andes\" to satisfy the magazine's bloodthirsty readership, Luciana must choose between the career that defined her and the man who taught her that the most intoxicating flavors come from embracing the beautiful chaos of unfiltered truth. A sensual collision of two worlds where surrender becomes the ultimate vintage.",
    "logLine": "Caught in a brutal hailstorm at a remote vineyard, a ruthless wine critic collides with a reclusive winemaker—and the untamed chemistry between them may cost her the pristine career she’s sacrificed everything for."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": null,
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}