{
  "id": "3af1eb8d-03d8-43db-8cce-10430bb88019",
  "title": "Evergreen Protocols",
  "author": {
    "name": "N.E. Laurent",
    "biography": "Wine critic in Lyon who writes sensory-rich romances set in French wine country."
  },
  "wordCount": 40917,
  "publicationDate": "2025-12-13T18:44:41.305025",
  "forceRank": null,
  "keywords": [
    "omegaverse romance",
    "Christmas fantasy",
    "reverse harem",
    "alpha omega dynamics",
    "North Pole setting",
    "holiday romance",
    "steam punk fantasy"
  ],
  "categories": [
    "Contemporary",
    "Workplace Romance",
    "Romantasy"
  ],
  "summary": {
    "under120": "In the depths of the North Pole's most restricted sector, Lead Engineer Hollyn Pine discovers that breaking the rules of Christmas magic requires more than just technical expertise—it demands surrendering to the three dangerously skilled Alpha operatives assigned to protect her. When sabotage threatens to ground Santa's sleigh forever, Hollyn must rewire the ancient propulsion system to run on the raw, forbidden energy generated by her intensely intimate bond with security chief Garland Ironwood, wild reindeer handler Bells Tinselsmith, and enigmatic navigator Mistletoe Northstar. As their connection deepens from professional necessity to primal need, this brilliant but isolated engineer learns that the most powerful fuel isn't found in any manual—it's forged in the heat of bodies pressed together at forty thousand feet, where the line between salvation and sin burns away entirely.",
    "under240": "After Hollyn Pine's engine explodes during a critical test, she discovers the sabotage that threatens Christmas itself—and finds herself under the protection of three dangerously attractive Alpha guards who ignite desires she never knew existed. When the pack's forbidden bond becomes the only power source capable of fueling the Sleigh through Jack Frost's deadly storm, Hollyn must choose between following protocol and embracing the raw, unfiltered connection that could save Christmas—or destroy everything she's worked for. As their telepathic link deepens with every heated encounter, the brilliant engineer realizes she's not just rebuilding the Sleigh's engine, but rewiring the very laws of magic with the scorching intensity of their pack bond.",
    "logLine": "A brilliant engineer discovers that forbidden desire is the most powerful fuel of all when she must save Christmas with three dangerously irresistible Alpha guardians."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": null,
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}