{
  "id": "f3dedc01-75ee-4e80-8fa5-d4994365cc4a",
  "title": "Revival",
  "author": {
    "name": "B.R. Whitfield",
    "biography": "Jazz pianist in New Orleans who writes musical romances set in smoky clubs and concert halls."
  },
  "wordCount": 45401,
  "publicationDate": "2025-12-13T16:03:53.527684",
  "forceRank": null,
  "keywords": [
    "small town romance",
    "enemies to lovers",
    "pastor's daughter",
    "bad boy contractor",
    "pregnancy romance",
    "religious rebellion",
    "blue collar hero"
  ],
  "categories": [
    "Contemporary",
    "Small Town Romance",
    "Enemies to Lovers"
  ],
  "summary": {
    "under120": "Behind the respectable facade of Grace Falls, the pastor's daughter discovers that salvation comes in the most dangerous form—when Riley inherits her grandmother's scandalous bar, she finds herself drawn to Cade Mercer, the town's tattooed pariah whose rough hands can build empires or break bones with equal skill. Their explosive attraction ignites a rebellion that will either liberate her from a lifetime of suffocating piety or destroy everything she's ever known, as Riley must choose between the safety of her gilded cage and the intoxicating peril of a man who sees straight through to her hidden fire.",
    "under240": "A contractor's rough hands awaken desires the pastor's daughter never knew existed when she inherits a notorious bar in small-town Montana. Riley Sullivan has spent twenty-five years perfecting the art of being invisible—playing piano for Sunday service, wearing beige cardigans, and suffocating under her father's rigid expectations. But when her grandmother leaves her *The Black Sheep*, a dive bar on the wrong side of town, Riley discovers a hunger she never knew she possessed. Enter Cade Mercer: ex-con, town pariah, and the only contractor willing to renovate her inheritance. His calloused hands don't just strip away rotting wood—they peel back the layers of repression Riley has worn like armor, revealing a woman desperate to burn down everything she's supposed to be. As their forbidden attraction ignites, Riley must choose between the suffocating safety of her father's world and a love that threatens to destroy her reputation forever. But when their passion creates consequences that can't be hidden, the real question becomes whether Cade will run from his own capacity to create something beautiful—or fight for the family that could redeem them both.",
    "logLine": "A small-town pastor's daughter abandons her pristine reputation when she inherits a dive bar and falls hard for the dangerous ex-con hired to renovate it—but their explosive affair creates more than just scandal when she discovers she's carrying his baby."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": null,
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}