{
  "id": "a6e55af6-cfdf-4978-bafb-29c12bbe4780",
  "title": "Audio Confessional",
  "author": {
    "name": "M.C. Hart",
    "biography": "Works as a yoga instructor in Austin, Texas, and lives with her two Bengal cats who regularly walk across her keyboard."
  },
  "wordCount": 29624,
  "publicationDate": "2025-11-22T17:27:39.429550",
  "summary": {
    "under120": "When claims adjuster Sarah Dubois investigates suspicious insurance patterns at a Miami firm, she finds herself drawn into the orbit of CEO Darius Castellanos—a magnetic man whose penthouse lifestyle and whispered Spanish endearments awaken desires she's spent years suppressing. But as Sarah trades her discount wardrobe for designer silk and her careful boundaries for passionate surrender, she discovers that Darius has built his empire on the stolen identities of Hurricane Katrina victims—including people from her own devastated childhood neighborhood. Caught between a love that feels intoxicatingly real and evidence of unforgivable betrayal, Sarah must choose between the man who makes her feel truly alive and the integrity that's supposed to make life worth living.",
    "under240": "When Sarah Dubois investigates suspicious insurance claims, she expects routine fraud—not the magnetic pull of CEO Darius Castellanos, whose whiskey-colored eyes and dangerous charm transform her careful world of clearance-rack suits and calculated risks. As Darius draws her into Miami's glittering penthouse life with silk lingerie and champagne dinners, Sarah discovers a passion that makes her forget every rule she's lived by since Hurricane Katrina taught her that safety trumps everything. But when she uncovers the devastating truth—that Darius has built his empire on stolen identities from her own hurricane-ravaged neighborhood—Sarah faces an impossible choice between the man who awakened her deepest desires and the integrity that's supposed to make survival worthwhile. With the FBI closing in and millions in blood money bearing her forged signature, Sarah must decide whether love can justify any betrayal, or if some prices are too high to pay even for the most intoxicating surrender.",
    "logLine": "When a hurricane claims adjuster investigating suspicious payouts discovers the CEO she's falling for has been stealing identities from the storm's victims—including her own childhood neighbors—she must choose between the man who makes her feel alive and the integrity that makes life worth living."
  }
}