{
  "id": "15e4e60c-b087-4598-8d04-699ed0afaa98",
  "title": "Altitude",
  "author": {
    "name": "Jade Summers",
    "biography": "Lives in Nashville where the local music scene keeps her inspired and her playlists curated."
  },
  "wordCount": 39594,
  "publicationDate": "2025-12-01T17:23:51.380668",
  "forceRank": null,
  "summary": {
    "under120": "When rare book restorer Margot Delacroix touches a mysterious grimoire in her French Quarter shop, she tears open the Veil between worlds—awakening not only ravenous shadow creatures but also Soren Vane, a starving exile who feeds on raw emotion and desire. As ancient hungers collide with Margot's explosive magical awakening, she must choose between the safety of her carefully controlled existence and surrendering to the intoxicating darkness of a man who could either save her world or consume her completely.",
    "under240": "When restoration expert Margot Delacroix touches a mysterious black grimoire in her New Orleans bookshop, she tears open the Veil between worlds and unleashes creatures that feed on human desire. Soren Vane, an exiled supernatural predator who survives by consuming raw emotion, emerges from the shadows to protect her—but his hunger for Margot's untapped magical energy creates a dangerous addiction neither can resist. As an ancient Entity wearing her dead twin brother's face manipulates her deepest grief, Margot must choose between the safe, sterile life she's built and embracing the volatile power that makes her both irresistible to monsters and capable of binding them. With reality crumbling around them and the Entity threatening to devour New Orleans, Margot and Soren forge a connection that transcends predator and prey—but their salvation requires a binding ritual that will forever intertwine their souls in ways that blur the line between ecstasy and annihilation.",
    "logLine": "When a reclusive book restorer accidentally opens a gateway to hell, she must choose between her safe, solitary life and surrendering to the dark desires of the dangerous exile who claims only she can save both worlds."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": null,
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}