{
  "id": "acb64691-4dbf-4d7d-8b8b-0e8686127516",
  "title": "Red Ledger",
  "author": {
    "name": "E.V. Callahan",
    "biography": "Brews craft beer in Asheville and writes small-town romances featuring quirky local establishments."
  },
  "wordCount": 40766,
  "publicationDate": "2025-12-04T16:16:18.943590",
  "forceRank": null,
  "keywords": [
    "Russian mafia romance",
    "forensic accountant heroine",
    "enemies to lovers",
    "Brighton Beach setting",
    "financial crime thriller",
    "forced proximity romance",
    "dark billionaire hero"
  ],
  "categories": [
    "Contemporary",
    "Billionaires & Millionaires",
    "Romantic Comedy"
  ],
  "summary": {
    "under120": "When forensic accountant Miriam Feldman accepts what seems like a routine consultation, she discovers the dangerous truth behind her family's debts—and finds herself irresistibly drawn to the enigmatic CFO whose dark past mirrors her own hidden desires. As Miri navigates the treacherous world of organized crime to protect those she loves, she must confront not only external threats but her own awakening need to surrender control to the one man who sees through her carefully constructed defenses.",
    "under240": "When accountant Miriam Feldman is blackmailed into cleaning the books for the Russian Bratva, she discovers that her captor—dangerous CFO Nikolai Volkov—is the boy who once watched her solve equations in high school. As Miri uncovers a web of embezzlement that threatens both their lives, she must choose between the safety of her ordered world and the intoxicating danger of the man who sees through her carefully constructed armor. But when bullets shatter their safe house and family secrets surface, Miri realizes that balancing this particular ledger will require her to risk everything—including her heart—in a deadly game where the stakes are fifty million dollars and the prize is survival. In this high-stakes financial thriller, a woman who has spent her life avoiding risk discovers that the most dangerous variable of all might be falling for the wolf who holds her mother's life in his scarred hands.",
    "logLine": "A forensic accountant discovers her mother's gambling debt is owned by the same Russian crime boss whose books she's been hired to audit—forcing her to choose between her principles and her family when the CFO who blackmailed her becomes the only man who can save them both."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": "https://mybook.to/GMZu2",
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}