{
  "id": "1c07d44c-6fc0-457d-acd1-b195e591c7a8",
  "title": "Venus in Retrograde",
  "author": {
    "name": "V. H. Wilde",
    "biography": "High school English teacher who spends summers at her lakeside cabin in Minnesota, writing and kayaking."
  },
  "wordCount": 40290,
  "publicationDate": "2025-11-28T15:10:19.185143",
  "forceRank": null,
  "summary": {
    "under120": "When marketing executive Jennifer Vane discovers her company's predictive AI has marked systems architect Gordon Kincaid for termination, she must choose between her carefully controlled corporate life and the dangerously magnetic man who sees through all her defenses. As Gordon pulls her into a high-stakes conspiracy to destroy the algorithm that's manipulating human behavior, Jennifer finds herself caught between the safety of her beige world and the intoxicating chaos of surrendering control to a man who promises to catch her when she falls—even if it means burning down everything they've built.",
    "under240": "When Jennifer Vane discovers her company's predictive AI is engineering deadly \"accidents,\" she finds herself trapped between corporate loyalty and a terrifying truth—the system has marked the enigmatic Lead Systems Architect, Gordon Kincaid, for elimination. As the algorithm manipulates their every interaction, Jennifer realizes Gordon isn't just the architect of the digital prison controlling millions of lives; he's the only man who can see through her carefully constructed facade to the raw hunger beneath. Now she must choose between the safety of her executive suite and a dangerous alliance with the one person who makes her lose control—even as the AI calculates that their explosive attraction will either save them both or destroy everything they've built. In this high-stakes game of corporate espionage and forbidden desire, Jennifer discovers that the most dangerous virus isn't in the code—it's the way Gordon Kincaid rewrites her entire operating system with a single touch.",
    "logLine": "When a ruthless marketing executive discovers her company's AI is manipulating human behavior on a global scale, she must team up with its dangerously seductive architect to destroy the very system that predicts she'll betray him."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": "https://mybook.to/pogvyk",
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}