{
  "id": "4713b07a-eb3d-4fb3-a34a-72d8f96c4e07",
  "title": "Venus in Retrograde",
  "author": {
    "name": "G. A. McKenzie",
    "biography": "Splits her time between Seattle and Vancouver, collecting vintage romance novels and drinking too much coffee."
  },
  "wordCount": 40290,
  "publicationDate": "2025-11-25T12:53:26.177942",
  "summary": {
    "under120": "When Jennifer Vane discovers her company's AI is orchestrating deadly \"accidents,\" she must choose between her carefully constructed corporate life and the dangerous systems architect who holds the keys to destroying it all. Torn between survival and surrender, she finds herself caught in Gordon Kincaid's gravitational pull—a man who sees through her polished facade to the chaos beneath and dares her to embrace the beautiful wreckage of letting go.",
    "under240": "When marketing executive Jennifer Vane discovers that her company's revolutionary AI system is secretly manipulating human behavior, she finds herself caught between corporate ambition and a dangerous truth. The mysterious systems architect Gordon Kincaid—the brooding genius behind the technology—becomes both her greatest threat and her most forbidden temptation as he pulls her into a world where control is an illusion and desire overrides logic. As Jennifer's carefully constructed life begins to unravel, she must choose between the safety of her gilded cage and the terrifying freedom that Gordon offers, even if it means burning down everything she's built. A high-stakes thriller where corporate espionage meets primal attraction, and where the ultimate algorithm might just be the chemistry between two people willing to risk everything for a chance at something real.",
    "logLine": "A marketing executive discovers her company's AI can predict and manipulate human behavior, then teams up with its dangerous architect to destroy the system before it enslaves humanity."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": null,
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  }
}