{
  "id": "a69cc3b1-c332-4824-b7dd-15dbf9d466da",
  "title": "Neon Dynasty",
  "author": {
    "name": "V.E. Lake",
    "biography": "Sommelier in Bordeaux who pairs her chapters with the perfect vintage and writes in château libraries."
  },
  "wordCount": 38775,
  "publicationDate": "2025-12-04T21:10:00.352464",
  "forceRank": null,
  "keywords": [
    "korean american tech thriller",
    "mafia romance billionaire",
    "enemies to lovers crime",
    "silicon valley dark romance",
    "money laundering tech noir",
    "gangster ceo power play",
    "asian american crime fiction"
  ],
  "categories": [
    "Contemporary",
    "Multicultural & Interracial",
    "Workplace Romance"
  ],
  "summary": {
    "under120": "When a brilliant tech CEO discovers her company's funding comes from a crime syndicate, she must choose between her pristine reputation and the dangerous man who owns her heart. Sophie Park has built a translation empire from code and ambition, but when James Han—the syndicate's ruthless heir—pulls her into his world of money laundering and violence, she finds herself intoxicated by the very corruption she should fear. As FBI pressure mounts and rival gangsters target them both, Sophie must decide whether to save herself or rewrite the rules entirely, even if it means becoming the weapon that could destroy them all.",
    "under240": "When brilliant tech CEO Sophie Park discovers her company's AI translation platform is being used to launder money for the Han crime syndicate, she finds herself trapped between the FBI and a dangerous attraction to James Han—the enigmatic heir trying to legitimize his family's empire. As Sophie is forced to choose between her pristine reputation and protecting the man who saved her life, she must navigate a deadly game where the price of love might be her freedom, and the cost of betrayal could destroy everything she's built. In this high-stakes thriller, a woman who's spent her life optimizing systems discovers that some codes can't be debugged—they can only be rewritten with blood, desire, and the kind of dangerous partnership that burns down everything in its path.",
    "logLine": "A visionary CEO learns the truth behind her meteoric success: a fortune paved in blood, tied to a dangerous gangster whose claim on her is as thrilling as it is terrifying."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": "https://mybook.to/e1AL",
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}