{
  "id": "99d65874-0279-4328-89fc-452f57511c51",
  "title": "The Apiarist's Touch",
  "author": {
    "name": "Jade Summers",
    "biography": "Lives in Nashville where the local music scene keeps her inspired and her playlists curated."
  },
  "wordCount": 39840,
  "publicationDate": "2025-12-01T15:21:28.373275",
  "forceRank": null,
  "summary": {
    "under120": "When a disgraced cartographer accepts a mysterious contract to map a private Greek island, she discovers that her enigmatic billionaire client has engineered far more than just the terrain—he's designed an elaborate psychological maze to strip away her defenses and expose the raw desire beneath her academic armor. As Sloane navigates increasingly intimate encounters across the island's sensually charged landscapes, she realizes she's not just mapping his fortress but becoming the key to unlocking his own carefully guarded vulnerabilities.",
    "under240": "When Dr. Sloane Rivers accepts a mysterious cartography contract on a remote Greek island, she expects to map terrain—not to become prey in billionaire Alexei Volkov's psychological labyrinth. Stripped of her digital devices and thrust into a fortress of engineered sensory experiences, Sloane discovers that Volkov hasn't hired her to survey his island—he's recruited her to find the fatal flaw in his impenetrable sanctuary. As Volkov manipulates her environment with magnetic interference, acoustic chambers, and thermal pools, Sloane realizes she's not just mapping geographical vulnerabilities but confronting the emotional devastation that drove her into academic exile. Their collision ignites a dangerous attraction that threatens both his obsessive need for control and her carefully constructed defenses, culminating in a high-stakes game where the ultimate prize isn't the island's secrets—but whether two damaged souls can surrender to the chaos of genuine connection. A dark, intensely erotic exploration of power, trauma, and the dangerous beauty of letting someone past your walls.",
    "logLine": "When a brilliant but damaged cartographer accepts a mysterious commission to map a billionaire's private Greek island, she discovers that the most dangerous territory isn't the land—it's the man who owns it."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": null,
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}