{
  "id": "aa93c2e1-35af-469d-a256-0afe74f10a69",
  "title": "Dragon's Claim",
  "author": {
    "name": "Ember Cross",
    "biography": "Firefighter-turned-author living in Phoenix, writing action-packed romances inspired by her former career."
  },
  "wordCount": 38505,
  "publicationDate": "2025-12-04T21:00:57.879680",
  "forceRank": null,
  "keywords": [
    "billionaire romance",
    "enemies to lovers",
    "restaurant romance",
    "dark romance",
    "mafia romance",
    "Asian American romance",
    "chef heroine"
  ],
  "categories": [
    "Contemporary",
    "Mafia Romance",
    "Workplace Romance"
  ],
  "summary": {
    "under120": "When a debt-ridden chef meets the enigmatic heir to a Triad empire, their partnership ignites into something far more dangerous than either anticipated. Mei-Lin Fong fights to save her failing Chinatown restaurant while Jason Tang seeks to legitimize his family's blood-soaked legacy—but their collision unleashes a hunger that transforms both predator and prey. As violence erupts around them and enemies close in, Mei-Lin discovers that surrendering to the dragon's fire might be the only way to forge something unbreakable from the ashes of their old lives.",
    "under240": "When Mei-Lin Fong's failing Chinatown restaurant becomes the target of a hostile takeover, she finds herself in an unlikely partnership with Jason Tang—the enigmatic heir to a criminal empire who's determined to legitimize his family's blood money. What begins as a desperate business arrangement ignites into something far more dangerous when Mei-Lin discovers that Jason's dark magnetism and ruthless protection awaken a hunger in her that matches his own violent devotion. But when Jason's enemies strike at the heart of everything Mei-Lin holds dear, she must choose between the safety of shadows and standing beside the dragon in his war—even if it means embracing the monster within herself. A scorching tale of power, possession, and the intoxicating surrender that comes when two damaged souls find their perfect match in each other's darkness.",
    "logLine": "To rescue her failing restaurant, a desperate chef allies with a lethal Dragon Head, but their blistering connection triggers a brutal turf war where passion cuts as deep as knives—and love becomes the deadliest gamble."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": null,
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}