{
  "id": "01a2a792-f397-4bf1-8672-1bf6bb73d20e",
  "title": "Heights",
  "author": {
    "name": "Rosalind Archer",
    "biography": "Fencing instructor in Budapest who writes swashbuckling historical romances with dueling scenes."
  },
  "wordCount": 40866,
  "publicationDate": "2025-12-04T21:17:01.295185",
  "forceRank": null,
  "keywords": [
    "community center romance",
    "Washington Heights setting",
    "construction boss hero",
    "enemies to lovers",
    "Latina heroine",
    "organized crime family",
    "workplace romance"
  ],
  "categories": [
    "Contemporary",
    "Alpha Male",
    "Workplace Romance"
  ],
  "summary": {
    "under120": "When the community center's new computers are destroyed and her name is painted in scarlet accusation across the walls, Carmen Reyes discovers that falling for dangerous benefactor Rafael Castillo has made her a target in a neighborhood war she never saw coming. As threats escalate to her family and Rafael tries to push her away for her own protection, Carmen realizes that her spreadsheets and grant-writing skills are the only weapons that can expose the corruption bleeding their project dry—and prove to the man who underestimated her that she's not just his perfect camouflage, but the architect of his salvation.",
    "under240": "When Carmen Reyes agrees to partner with Rafael Castillo on a five-million-dollar community center initiative, she believes she's securing her neighborhood's future—until she discovers the dangerous cost of dancing with the devil in a designer suit. The brilliant nonprofit director has spent years invisibly holding together Washington Heights' crumbling infrastructure, but Rafael sees through her camouflage to the fierce architect beneath, igniting a combustible attraction that threatens everything she's built. As Rafael's volatile cousin Mateo wages war against their partnership through violence and intimidation, Carmen must choose between the safety of shadows and the intoxicating power of standing beside a man whose family name opens doors and closes caskets. When the conflict escalates to threats against her sister, Carmen discovers that her greatest weapon isn't Rafael's protection—it's her own razor-sharp competence and willingness to burn down the corrupt system from within. This scorching tale of ambition and desire explores what happens when a woman who fixes everyone else's problems finally claims the power to architect her own destiny.",
    "logLine": "A hard-edged community center director uncovers the truth about her shadowed benefactor—a dangerous Castillo heir whose pull is as intoxicating as it is perilous—and she must decide whether to resist him, or gamble everything she’s built on desire."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": "https://mybook.to/JpcqMRk",
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}