{
  "id": "f581e3f9-525d-489d-9db9-b54e710d9831",
  "title": "The Devil's Deal",
  "author": {
    "name": "Rosalie Vance",
    "biography": "Antique dealer in New Orleans who hunts for treasures by day and writes steamy historicals by night."
  },
  "wordCount": 40419,
  "publicationDate": "2025-12-04T21:30:54.509158",
  "forceRank": null,
  "keywords": [
    "undercover romance suspense",
    "FBI agent gone rogue",
    "Miami crime thriller",
    "enemies to lovers dark",
    "cartel boss romance",
    "federal agent betrayal",
    "dangerous love affair"
  ],
  "categories": [
    "Contemporary",
    "Enemies to Lovers",
    "Romantic Suspense"
  ],
  "summary": {
    "under120": "When forensic accountant Elena Vance infiltrates the Moreno syndicate to expose its financial crimes, she discovers that Rafael Moreno—the dangerously compelling heir trying to legitimize his family's empire—sees straight through her carefully constructed lies. As their professional relationship ignites into a scorching affair that blurs every line between duty and desire, Cami must choose between the badge that defines her and the man who owns her completely. But when her corrupt handler orchestrates a deadly trap that threatens to destroy them both, she'll risk everything—her career, her freedom, and her life—to protect the devil she's fallen for, even if it means becoming the very criminal she was sent to catch.",
    "under240": "When forensic accountant Elena Vance walks into the glass tower of Miami's most dangerous predator, she's armed with spreadsheets and a hidden wire—but Rafael Moreno sees through her lies with terrifying ease. Sent undercover to expose the heir to a criminal empire, Elena expects to find a monster; instead, she discovers a man desperately trying to wash blood money clean while his enemies circle like sharks. As Rafael's touch ignites a hunger she's never known and his dark confessions reveal a soul worth saving, Elena faces an impossible choice: complete her mission and destroy the only man who's ever seen her true self, or burn her badge and join him in the fire. But when her handler's corruption runs deeper than the cartel's sins and bullets start flying in Miami's elite ballrooms, Elena must decide if love is worth treason—and if she's willing to become the very weapon that could save them both or damn them forever.",
    "logLine": "An undercover FBI agent discovers her corrupt handler plans to use her as bait to murder the cartel boss she's fallen dangerously in love with, forcing her to choose between her badge and her heart in a deadly game where betrayal is the only currency."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": "https://mybook.to/9AXb73",
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}