{
  "id": "c3459a06-b319-480c-9ea9-fd192e15e44c",
  "title": "The Veil Between",
  "author": {
    "name": "E.R. Cole",
    "biography": "Manages her family's horse ranch in rural Montana while writing contemporary romance between ranch duties."
  },
  "wordCount": 39594,
  "publicationDate": "2025-12-01T16:18:36.256565",
  "forceRank": null,
  "summary": {
    "under120": "When a reclusive New Orleans book restorer touches an ancient grimoire, she tears open the barrier between worlds and awakens something that should have stayed buried. Margot Delacroix has spent a decade hiding behind high collars and restoration glue, but the mysterious Soren Vane—a starving exile from the shadow realm—forces her to confront the truth: she's a Keeper, bound to guard the door between dimensions, and the Entity on the other side will use her deepest grief to claw its way into reality. As darkness bleeds into her sanctuary and phantoms wearing her dead brother's face whisper promises of reunion, Margot must choose between the safety of denial and a dangerous alliance with the beautiful predator who feeds on her forbidden desires—because when the final seal breaks, only their combined fire and shadow can forge a lock strong enough to cage eternity itself.",
    "under240": "When rare book restorer Margot Delacroix touches an ancient grimoire in her New Orleans shop, she tears open the Veil between worlds—and attracts the attention of both ravenous shadow creatures and Soren Vane, a devastatingly dangerous exile from the supernatural realm. As Margot's repressed magical abilities explode to the surface in violent, uncontrolled bursts, she discovers she's a Keeper—a living lock meant to guard the barrier between dimensions. But the Entity, an ancient force of pure hunger, has been waiting decades to use her brother Julian's death as the key to break through, wearing his beloved face to manipulate her into opening the door wide. Soren, a former High Keeper who starved himself for centuries rather than drain another human dry, becomes both her teacher and her salvation as their connection deepens from reluctant alliance to desperate codependence. When the Entity finally breaks through and begins consuming reality itself, Margot and Soren must perform an ultimate binding ritual—merging their essences through an act of raw, transformative intimacy that will either save both worlds or destroy them. This scorching paranormal romance explores the razor's edge between salvation and damnation, where love becomes the most dangerous magic of all.",
    "logLine": "When a reclusive bookshop owner accidentally tears open the barrier between worlds, she must bind her soul to a starving shadow-demon to seal the breach—but the price of salvation is an addiction to darkness that will consume them both."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": "https://mybook.to/j30K",
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}