{
  "id": "6ac8674d-9192-410c-9ca8-38b91ee708bb",
  "title": "Salt and Sun",
  "author": {
    "name": "O.W. Hartley",
    "biography": "Lives in a treehouse in Costa Rica, writing tropical romances while howler monkeys provide the soundtrack."
  },
  "wordCount": 41234,
  "publicationDate": "2025-12-04T00:02:51.069734",
  "forceRank": null,
  "summary": {
    "under120": "When a burned-out Chicago executive washes up on Puerto Rico's shores, she discovers that the most dangerous currents aren't in the boardroom—they're in the calloused hands of the island carpenter who sees straight through her armor. Carolina Vega thinks she's taking a recovery vacation from her high-pressure city life, but after a tropical storm leaves her stranded with Joaquín, a fiercely protective craftsman fighting developers threatening his ancestral land, she finds herself caught between two worlds: the sterile safety of executive success and the raw, elemental pull of a man who demands nothing less than complete surrender to the untamed beauty of the island—and to him.",
    "under240": "When corporate shark Carolina Vega flees to Puerto Rico to escape her suffocating Chicago life, she expects a quiet vacation rental—not a collision with Joaquín, the infuriatingly arrogant carpenter next door whose pre-dawn power tools shatter her carefully controlled world. But when a tropical storm destroys her sanctuary and forces her into his workshop, Carolina discovers that the man who builds surfboards with his hands knows exactly how to dismantle her defenses. As a predatory developer threatens Joaquín's ancestral land, Carolina must choose between the executive partnership that promises ultimate safety and the dangerous, dust-covered man who's teaching her that true power isn't found in boardrooms—it's found in surrender. This scorching enemies-to-lovers romance explores what happens when a woman who's spent her life controlling everything meets the one man who can make her beg to let go.",
    "logLine": "Fleeing to Puerto Rico after a breakdown, a burned-out Chicago exec butts heads with the rugged carpenter next door—until a storm locks them in together and sparks a passion that could rebuild her from the inside out."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": null,
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}