{
  "id": "d4c5ce3f-29a9-4520-a903-ab3f088b1cbc",
  "title": "Blood Covenant",
  "author": {
    "name": "Sage Holloway",
    "biography": "Wilderness therapist in Montana who writes healing romances set against mountain backdrops."
  },
  "wordCount": 39351,
  "publicationDate": "2025-12-12T13:52:12.486910",
  "forceRank": null,
  "keywords": [
    "vampire romance urban fantasy",
    "blood magic witch doctor",
    "omega verse bonding ritual",
    "supernatural medical thriller",
    "dark paranormal romance",
    "hemomancy blood witches",
    "vampire pack dynamics"
  ],
  "categories": [
    "Contemporary",
    "Romantasy",
    "Polyamory"
  ],
  "summary": {
    "under120": "**A hemomancer's hunger awakens when three dying vampires crash into her underground clinic, shattering the careful chemical suppressants that have kept her Omega nature—and her deadly blood magic—locked away.** Dr. Crimson Shaw has spent years hiding from the Witch Council's purification crusade, but when she uses a forbidden ritual to save the vampires' lives, she binds herself to them in ways that transcend medicine. As the High Priestess unleashes a plague designed to cleanse the city of \"impure\" supernatural blood, Crimson must embrace the monster she's always feared becoming—because the very power that makes her dangerous might be the only thing that can stop a genocide.",
    "under240": "After a hemomantic plague nearly destroys New York's supernatural community, Dr. Crimson Shaw—a blood witch hiding her true nature—performs a desperate ritual that saves three dying vampires while binding them all together in an unbreakable pack bond. When the fanatical High Priestess Seraphina Hallow attempts to use Crimson as a living weapon to complete her genocidal \"purification\" of the city, Crimson must embrace the monster she's spent her life suppressing and channel the raw power of her Alpha mates to stop a magical apocalypse. This dark urban fantasy weaves visceral medical horror with explosive pack dynamics as Crimson discovers that the greatest threat isn't the darkness she carries—it's the light she's finally ready to unleash, fueled by the devotion of three apex predators who would burn the world to keep her safe.",
    "logLine": "A brilliant doctor with forbidden blood magic bonds with three vampires to stop a genocidal witch, discovering that embracing her monstrous nature is the only way to save both herself and the supernatural underground."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": null,
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}