{
  "id": "3e190b06-82b7-4791-8e40-d207db51aca0",
  "title": "Aces Wild",
  "author": {
    "name": "V.S. Sinclair",
    "biography": "Investigative journalist in Washington D.C. who writes romantic suspense with political intrigue."
  },
  "wordCount": 39438,
  "publicationDate": "2025-12-05T10:20:01.608715",
  "forceRank": null,
  "keywords": [
    "vegas casino romance",
    "enemies to lovers",
    "financial thriller",
    "mob family legacy",
    "auditor hero",
    "casino heist",
    "money laundering",
    "blackmail suspense",
    "vintage vegas",
    "corporate takeover",
    "forensic accounting",
    "steamy romance"
  ],
  "categories": [
    "Contemporary",
    "Romantic Comedy",
    "Workplace Romance"
  ],
  "summary": {
    "under120": "When casino heiress Rachel Goldstein finds herself under siege by corporate predator Julian Vane, the arrival of coldly brilliant auditor Ezra Katz seems like the final blow—until she discovers he's trapped in the same deadly game. As Rachel fights to save her family's legendary Desert Siren from demolition, she and Ezra ignite a dangerous alliance that transforms from bitter adversaries to co-conspirators, their explosive chemistry burning as hot as the secrets they're desperate to protect in the neon-soaked underworld of Las Vegas.",
    "under240": "When forensic auditor Ezra Katz arrives at *The Desert Siren* casino to investigate Rachel Goldstein's books, he expects to find the usual sins of a failing Vegas establishment—but Rachel proves to be a dangerously compelling anomaly in his carefully calculated world. Caught between his blackmailer Julian Vane and his growing obsession with the casino heiress, Ezra discovers that Rachel's vault holds more than vintage secrets when she trusts him with explosive evidence that could destroy them both. As their professional dynamic ignites into a scorching battle of wills—played out in shadowy back rooms and gold-dusted vaults—Ezra must choose between the safety of his forensic precision and the chaotic thrill of a woman who treats seduction like a high-stakes card game. With Vane's hostile takeover closing in and Rachel's legacy crumbling, their only chance lies in a dangerous gamble that will either save *The Desert Siren* or burn them both to the ground—but first, Ezra must learn to play by Rachel's rules, where the house always wins and surrender feels like the ultimate audit.",
    "logLine": "Sent to audit a mob-tangled family casino, a forensic accountant becomes the target of a desperate heiress who must seduce him to save her legacy—only to learn he’s being blackmailed, and the two ignite a dangerous alliance to pull off the ultimate heist."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": "https://mybook.to/t25F66",
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}