{
  "id": "dde807d9-bb42-4118-91d2-ba25c16860fb",
  "title": "The Extraction",
  "author": {
    "name": "N.P. Thorn",
    "biography": "Lives in Boston with her wife, sharing a brownstone filled with books that occupy nearly every room."
  },
  "wordCount": 35117,
  "publicationDate": "2025-12-02T01:55:02.810276",
  "forceRank": null,
  "summary": {
    "under120": "When investigative journalist Diane Okonjo discovers her aid worker brother has vanished near the volatile Krasnovia border, she abandons her safe London life to hire the only man capable of navigating the lawless territory—Mikhail Volkov, a ruthless mercenary whose glacial eyes see her as nothing more than fragile cargo. But as they plunge deeper into a frozen wasteland where death stalks every shadow, Diane finds herself craving the brutal protection of the wolf who treats her like prey, surrendering to a dark hunger that transforms her from victim into predator in his unforgiving embrace.",
    "under240": "When journalist Diane Okonjo receives word that her aid worker brother has vanished in the lawless border region of Krasnovia, she knows the government's \"trust the process\" approach will leave him dead. Desperate to mount her own rescue, she tracks down Mikhail Volkov—a legendary mercenary fixer who once carried her out of a Syrian hellscape—and strikes a dangerous bargain for his services. What begins as a straightforward extraction quickly spirals into something far more perilous when they discover her brother possesses evidence of a war crime that powerful men will kill to bury. As they navigate treacherous mountain passes and deadly firefights, Diane finds herself magnetically drawn to Mikhail's brutal competence and unwavering protection, craving the intoxicating surrender of letting someone else bear the weight of survival. The forbidden attraction between the broken journalist and the deadly wolf who guards her becomes a lifeline in the darkness—but when their mission turns into a race against death itself, Diane must choose between the safety she's always sought and the dangerous man who makes her feel devastatingly alive.",
    "logLine": "A bold journalist hires a deadly mercenary to rescue her brother from war-torn Krasnovia, but survival demands a surrender of body and control—to the monster who terrifies her even as he becomes the one thing she can’t stop wanting."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": null,
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}