{
  "id": "4a0fa9c5-a7a2-49e4-b3ef-2a47607e0335",
  "title": "Premium Risk",
  "author": {
    "name": "S.J. Winters",
    "biography": "Former bartender who now writes full-time from her Brooklyn apartment, sharing her space with a cat named Hemingway."
  },
  "wordCount": 29624,
  "publicationDate": "2025-11-22T17:56:53.165611",
  "summary": {
    "under120": "When claims adjuster Sarah Dubois investigates suspicious payouts at a Miami insurance firm, she never expects to be seduced by the dangerously charismatic CEO whose empire may be built on fraud. As Darius Castellanos draws her into a world of silk sheets and stolen money, Sarah discovers he's been systematically exploiting Hurricane Katrina victims—including people from her own devastated neighborhood—while positioning her as the perfect fall guy should his operation crumble. Now she must choose between the intoxicating luxury of their affair and the integrity that defines her, knowing that loving him might cost her everything she's fought to rebuild since losing her family home to the storm.",
    "under240": "When claims adjuster Sarah Dubois investigates suspicious insurance patterns at Castellanos Insurance Group, she expects routine fraud—not to be swept away by the company's magnetic CEO, Darius Castellanos. As he introduces her to a world of silk sheets, penthouse dinners, and desires she's kept buried since Hurricane Katrina destroyed her family's life, Sarah discovers the intoxicating power of surrendering control to a man who seems to understand her deepest needs. But when she uncovers that Darius has built his empire on the stolen identities of Katrina victims—including her own childhood neighbors—Sarah faces an impossible choice between the passionate love that's awakened her and the integrity that's supposed to define her. With the FBI closing in and offshore accounts bearing her forged signature, she must decide whether to save the man who's claimed her body and soul, or save herself from becoming his most devastating casualty.",
    "logLine": "A claims adjuster investigating insurance fraud discovers her lover has been stealing identities from Hurricane Katrina victims—including her own neighbors—forcing her to choose between the man who gave her everything and the integrity that defines her."
  }
}