{
  "id": "7882ecb5-be3c-460d-a0ee-4d9df692b9a3",
  "title": "Witness",
  "author": {
    "name": "Odessa Flynn",
    "biography": "Sailing instructor in the Greek islands who writes sun-drenched Mediterranean love stories."
  },
  "wordCount": 35925,
  "publicationDate": "2025-12-04T16:03:56.803578",
  "forceRank": null,
  "keywords": [
    "dark mafia romance",
    "enemies to lovers",
    "captive romance",
    "Russian mob boss",
    "witness protection",
    "casino thriller",
    "possessive alpha hero"
  ],
  "categories": [
    "Contemporary",
    "Mafia Romance",
    "Enemies to Lovers"
  ],
  "summary": {
    "under120": "When a casino waitress witnesses a brutal murder, she becomes trapped in a deadly game between survival and desire with the killer himself—a ruthless Russian enforcer who offers her three months of protection in exchange for her silence, igniting a dark obsession that transforms captivity into an intoxicating dance of power and submission. As Maren discovers that her captor's violence masks a tortured protector's heart, she must choose between the freedom she's always craved and surrendering to the monster who makes her feel truly alive for the first time.",
    "under240": "When casino waitress Maren Cole witnesses a brutal murder in the VIP suite of The Sapphire Sovereign, she becomes the only thing standing between Russian enforcer Alexei Volkov and a war that could destroy them both. Alexei offers her a devil's bargain: three months of protection in his penthouse prison in exchange for her silence—and five hundred thousand dollars if she survives. But as Maren finds herself trapped in a glass cage high above the Vegas Strip with a man who kills as easily as he breathes, the real danger isn't the enemies hunting her—it's her growing obsession with the monster holding her captive. Alexei Volkov has spent years building walls around his heart, haunted by his failure to protect his sister from the very criminals now pursuing Maren. What begins as a calculated arrangement to keep a witness alive becomes something far more dangerous when he realizes the broken waitress isn't just another victim to shield—she's the one person fearless enough to see the man beneath the killer and strong enough to make him want to be saved. As the glass walls of their sanctuary shatter under enemy fire, Maren must choose between the safety of running and the terrifying intimacy of surrendering to a man whose love feels like both salvation and damnation.",
    "logLine": "After seeing a murder she was never meant to witness, a casino waitress is spared—and claimed—by a ruthless hitman, discovering that the most dangerous place she could be is in the arms sworn to keep her alive."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": null,
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}