{
  "id": "a674a3e5-07af-4ff0-be77-b9269addfc5b",
  "title": "The Exhibition",
  "author": {
    "name": "V. H. Wilde",
    "biography": "Resides in the English countryside with her husband and three children, writing late at night after the household goes to sleep."
  },
  "wordCount": 20511,
  "publicationDate": "2025-11-25T16:11:48.661456",
  "summary": {
    "under120": "When barista-turned-artist Claire MacAdam receives an unexpected invitation from the legendary Elias Ashford—the untouchable \"Ice King\" of Chelsea's art world—she discovers he wants more than her paintings: he wants to document their intimate connection as living art. As Claire trades her coffee shop apron for the spotlight of high-stakes gallery culture, she must navigate the intoxicating power of being truly seen while defending her choices against a world determined to cast her as victim rather than creator.",
    "under240": "When barista-turned-artist Claire MacAdam receives an unexpected invitation from legendary gallery owner Elias Ashford, she discovers he wants more than her paintings—he wants her as both muse and co-creator in an unprecedented exhibition exploring the raw intersection of desire and art. What begins as a professional collaboration quickly evolves into an intoxicating blend of creative partnership and sexual awakening, as Claire finds herself stepping out of invisibility and into the blazing spotlight of New York's elite art world. But when a vicious blogger twists their relationship into a scandal of exploitation and abuse, Claire must choose between retreating to safety or standing her ground to reclaim her narrative. A provocative tale of artistic ambition, erotic discovery, and a woman's fierce fight to own her choices, this audiobook delivers both searing sensuality and a powerful exploration of agency, desire, and the price of being truly seen.",
    "logLine": "When a desperate barista agrees to become both muse and subject in a controversial art exhibition with Manhattan's most ruthless gallery owner, their collaboration blurs the line between creation and destruction."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": null,
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}