{
  "id": "4b4ea867-823f-4dcb-b336-b8c432904d27",
  "title": "Live Wire",
  "author": {
    "name": "N.P. Thorn",
    "biography": "Lives in Boston with her wife, sharing a brownstone filled with books that occupy nearly every room."
  },
  "wordCount": 36223,
  "publicationDate": "2025-12-03T12:57:31.849517",
  "forceRank": null,
  "summary": {
    "under120": "When sound engineer Carmen Avila agrees to produce reclusive folk singer Declan Wolfe's comeback album, she discovers a man whose raw talent is matched only by his fear of exposure—until their creative partnership ignites into a passionate collision that forces both to choose between safety and the dangerous, electrifying truth of their art. As Carmen abandons her carefully controlled world to capture Declan's unfiltered voice, she must decide whether to protect her career or risk everything to let their music—and their love—burn bright and uncompromising.",
    "under240": "When a reclusive sound engineer meets a broken folk legend in her Austin studio, Carmen Avila discovers that some frequencies can't be contained behind soundproof walls. Declan Wolfe arrives carrying ten years of silence and a reputation for self-destruction, but when Carmen hears the raw power beneath his polished facade, she makes a dangerous choice—to strip away the safety of her control room and follow him into the wild heat of the Texas Hill Country. \n\nAs they record in an isolated cabin where the cicadas scream louder than any amplifier, Carmen finds herself caught between two kinds of electricity: the crackling tension of their musical collaboration and the undeniable pull of Declan's damaged magnetism. But when the industry demands they sanitize their visceral, bleeding-edge sound, Carmen must choose between the security of her carefully constructed fortress and the terrifying freedom of letting the signal run hot—even if it means losing everything she's built to save the man who's become her perfect frequency match.\n\nTheir forbidden studio sessions become a high-stakes game of creative and sexual surrender, where every take recorded threatens to expose not just Declan's fractured soul, but Carmen's own hunger to finally step out from behind the glass and claim her place in the mix.",
    "logLine": "A solitary producer teams up with a shattered folk icon to resurrect his career, but the music they create in a Hill Country hideaway ignites a wildfire of desire—one that could either heal them or burn through every boundary they’ve set."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": "https://mybook.to/PRVpy",
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}