{
  "id": "5b9f93e2-a276-489b-bb2c-afde7942bb41",
  "title": "The Tango Thief",
  "author": {
    "name": "T.L. Fox",
    "biography": "Lives in Toronto and writes in a different coffee shop each week, fueled by espresso and people-watching."
  },
  "wordCount": 38140,
  "publicationDate": "2025-12-02T01:26:09.971929",
  "forceRank": null,
  "summary": {
    "under120": "When notorious street dancer Valentina Reyes slaps the Architect—Marco Oliveira, tango's most precise and coldly brilliant choreographer—their explosive collision ignites a dangerous game of power and submission that neither can resist. Desperate to save her eviction-threatened apartment, Valentina agrees to let the ruthless perfectionist reshape her raw, chaotic style for the international competition circuit, but as Marco's clinical corrections become increasingly intimate, she discovers that beneath his sterile control lies a man starving for the very chaos he's trying to tame. As they dance deeper into each other's darkness, the line between artistic partnership and obsessive need dissolves, leaving them both breathless and burning for a surrender that could destroy everything they've built—or forge them into something devastatingly unstoppable.",
    "under240": "When a viral video of street dancer Valentina Reyes catches the eye of the prestigious International Tango Summit, she's paired with Marco Oliveira—the \"Architect,\" a coldly perfect champion who treats tango like a mathematical equation. Desperate to escape eviction and honor her late grandmother's legacy, Valentina enters Marco's sterile glass studio where he systematically dismantles everything wild and authentic about her dancing. But when the heatwave breaks the air conditioning and forces them into each other's arms, the friction between his rigid control and her chaotic fire ignites into something neither can choreograph away. As Marco struggles between a career-defining offer from the Royal Ballet and his dangerous addiction to Valentina's untamed spirit, she must decide whether to let him reshape her into his vision of perfection—or burn down his carefully constructed world and make him dance in the mud where real passion lives.",
    "logLine": "Forced into a high-stakes tango partnership, a fierce street dancer from Buenos Aires and a cool-as-steel Brazilian architect ignite a chemistry that melts every barrier—especially the ones protecting their hearts."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": null,
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}