{
  "id": "7e68635b-3ec9-4d3f-9ce1-ac12a1423572",
  "title": "The Cartographer's Desire",
  "author": {
    "name": "Phoenix Rivers",
    "biography": "Former librarian who now lives in Denver with her golden retriever and an ever-growing home library."
  },
  "wordCount": 39840,
  "publicationDate": "2025-12-01T15:24:58.458286",
  "forceRank": null,
  "summary": {
    "under120": "When cartographer Dr. Sloane Rivers accepts a lucrative contract to map a mysterious Greek island, she discovers that billionaire Alexei Volkov has engineered far more than just the terrain—he's designed an elaborate psychological experiment with her as the unwitting subject. As Sloane navigates the island's disorienting gardens and hidden grottos, she uncovers not only a dangerous security breach that threatens Volkov's fortress-like sanctuary, but also her own capacity for surrender to a man who maps desire with the same ruthless precision he applies to everything else.",
    "under240": "When brilliant cartographer Dr. Sloane Rivers accepts a commission to map a mysterious Greek island, she expects to survey terrain—not to become the subject of an elaborate psychological experiment. Billionaire Alexei Volkov has engineered every inch of Kythira Minor as a sensory labyrinth designed to strip away her defenses, knowing her history of academic betrayal makes her uniquely vulnerable to his manipulations. As Sloane navigates gardens that whisper, grottos that seduce, and magnetic fields that scramble her instruments, she discovers Alexei hasn't just hired her to find flaws in his fortress—he's orchestrated an intricate seduction to expose the woman beneath the scientist. But when enemies close in and the island's darkest secrets surface, Sloane must choose between the safety of her carefully mapped world and the terrifying exhilaration of surrendering to a man who sees her trauma as the key to unlocking her deepest desires. In this erotic thriller where power dynamics shift like tectonic plates, two damaged souls discover that the most dangerous territory to explore isn't geological—it's the uncharted landscape of trust, desire, and the courage to be completely unmapped.",
    "logLine": "A brilliant cartographer discovers that mapping a billionaire's private Greek island means charting the dangerous territory of desire itself—where every survey leads deeper into obsession, and the most treacherous landscape is the human heart."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": "https://mybook.to/xxaz7",
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}