{
  "id": "87294b8f-1635-4d79-abcf-1a5fad8f6c8c",
  "title": "Bluegrass and Bourbon",
  "author": {
    "name": "A.B. Frost",
    "biography": "Lives in Portland with her two rescue dogs and a plant collection that has taken over most of her living room."
  },
  "wordCount": 39914,
  "publicationDate": "2025-12-03T17:05:57.326086",
  "forceRank": null,
  "summary": {
    "under120": "When disgraced veterinarian Dr. Amara Osei takes a desperate job at a failing Kentucky distillery, she expects to quietly rebuild her shattered reputation—until she meets Elijah Booker, the reluctant heir whose raw strength and unwavering loyalty ignites a dangerous hunger she's spent years suppressing. As the powerful enemy who destroyed her career circles closer, threatening to claim both the distillery and her fragile second chance, Amara must choose between the safety of solitude and surrendering to a man whose touch promises to either heal her completely or ruin them both.",
    "under240": "When veterinarian Amara Osei receives an emergency call to a failing Kentucky distillery in the dead of night, she discovers more than just a colicky horse—she finds Elijah Booker, the reluctant heir fighting to save his family's bourbon legacy with nothing but grit and determination. Amara's fallen from grace after a scandal orchestrated by powerful industry magnate Sterling Thorne destroyed her career, leaving her scraping by with farm calls and struggling to rebuild her reputation. As she works alongside Elijah in the sultry Kentucky heat, their professional relationship ignites into something dangerously intimate—his commanding presence in crisis and protective instincts awakening desires she's kept buried beneath her clinical armor. When Thorne resurfaces to destroy them both, using Amara's disgrace as leverage to force Elijah into bankruptcy, she must choose between the safety of exile and fighting for the man who sees her not as damaged goods, but as the fierce, competent woman who can match his intensity. Their battle becomes a high-stakes game where Amara's medical expertise and hidden evidence of Thorne's crimes could save the distillery—or destroy them both if the explosive truth about fraud and family secrets comes to light.",
    "logLine": "Called to a failing Kentucky distillery in desperate need of help, a disgraced veterinarian meets a brooding owner who stands up for her when no one else will—and together they must face a ruthless threat determined to take everything."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": "https://mybook.to/qX5K",
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}