{
  "id": "47babd9c-56d6-4f11-b0f6-23c84d78fa6a",
  "title": "The Terms",
  "author": {
    "name": "Savannah Knight",
    "biography": "Left her corporate job to write full-time in Miami, living in an art deco apartment near the beach."
  },
  "wordCount": 47994,
  "publicationDate": "2025-12-01T13:59:29.546789",
  "forceRank": null,
  "summary": {
    "under120": "When high-powered attorney Simone Laurent faces off against ruthless venture capitalist Adrian Cross over a billion-dollar merger, their explosive boardroom chemistry ignites a dangerous game of power and submission. As Adrian offers her the ultimate proposition—surrender her legendary control in exchange for the silence her traumatized mind craves—Simone discovers that the man determined to acquire her client's company may be the only one capable of dismantling the walls she's built around her heart.",
    "under240": "When corporate attorney Simone Laurent faces off against venture capitalist Adrian Cross in a high-stakes merger negotiation, she expects another ruthless adversary—not a man who sees straight through her armor to the woman trembling beneath. Adrian doesn't just want to acquire her client's company; he wants to strip away every defense Simone has built since her devastating betrayal by her former partner Julian Vane. As their professional battles escalate into an intensely private arrangement where Adrian commands her complete surrender, Simone discovers that the most dangerous mergers aren't about companies—they're about hearts that have forgotten how to trust. But when Julian resurfaces with explosive footage that could destroy them both, Simone must choose between the safety of her carefully controlled world and a love that demands she risk everything for the one man strong enough to catch her when she falls.",
    "logLine": "A razor-sharp corporate lawyer falls under the sway of a billionaire who promises quiet for her stormed mind—if she gives him total control—and their escalating power play jeopardizes the merger that could make or break them both."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": "https://mybook.to/UgtVzSF",
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}