{
  "id": "43a9361d-2304-465c-bbb4-204d394174bd",
  "title": "Bloodright",
  "author": {
    "name": "J.R. Wilde",
    "biography": "Digital nomad who writes from wherever her travels take her, currently based in Barcelona for six months."
  },
  "wordCount": 41672,
  "publicationDate": "2025-12-04T15:33:23.079121",
  "forceRank": null,
  "keywords": [
    "mafia romance books",
    "chef heroine romance",
    "bodyguard protector romance",
    "enemies to lovers mafia",
    "Italian American crime family",
    "restaurant setting romance",
    "dark romance suspense"
  ],
  "categories": [
    "Contemporary",
    "Mafia Romance",
    "Workplace Romance"
  ],
  "summary": {
    "under120": "When a mysterious stranger walks into Chef Gianna Santoro's kitchen and reveals she's inherited a deadly legacy, she must navigate the treacherous world of organized crime while fighting her intense attraction to Dante Ferraro, the enigmatic enforcer sworn to protect her. As bullets shatter her sanctuary and enemies close in, Gia discovers that surviving her birthright will require more than culinary skills—it will demand she embrace the darkness within herself and the dangerous man who worships her with lethal devotion.",
    "under240": "When Gianna Santoro inherits her estranged father's criminal empire, the last thing she expects is to trade her chef's knife for a target on her back—or to find herself under the protection of Dante Ferraro, a scarred enforcer whose devotion runs deeper than duty. As rival factions move to eliminate the \"kitchen girl\" who threatens their power, Dante becomes both her shield and her greatest temptation, a man whose violent past collides with Gia's fierce independence in the most dangerous ways. But when Marco, her treacherous cousin, orchestrates a bloody coup to claim the family throne, Gia must choose between the safety of her restaurant and the deadly game of succession—all while fighting her explosive attraction to the wolf who's sworn to protect her. In a world where loyalty is bought with blood and power is served cold, Gia discovers that survival means embracing both the fire in her kitchen and the darkness in her veins, even if it costs her everything she thought she wanted.",
    "logLine": "After inheriting her mobster father’s empire, a fierce chef is forced to rely on the lethal enforcer sworn to guard her, though their blistering attraction could be the fire that saves them—or burns everything down."
  },
  "links": {
    "goodReadsLink": null,
    "ebookAmazonLink": "https://mybook.to/iIubLU",
    "ebookAppleLink": null,
    "audiobookAmazonLink": null,
    "audiobookAppleLink": null
  },
  "sampleChapterPath": "sample-chapter.md"
}